/*重要功能函数*/

//****************************************************************//
//调用此函数，则可以清空屏幕，并打印出程序边框,最后光标在（24，9）//
//****************************************************************//


//边框四角： (24,6),(86,6),(24,28),(86,28)//
//上下中点纵坐标标:18//
//左右中点横坐标:55//

#include"function.h"

void print_head()
{
    int i;
    system("cls");
    gotoxy(24,6);
    for(i=0; i<16; i++)  //设置上边框//
    {
        printf("——");
    }
    gotoxy(47,7);
    printf("|教务信息管理系统|\n");         //程序名字//
    gotoxy(47,8);
    printf("————————\n");                 //程序名字下划线//

    gotoxy(24,28);
    for(i=0; i<16; i++)  //设置下边框//
    {
        printf("——");
    }

    for(i=6; i<=28; i++)    //设置左右边框//
    {
        gotoxy(23,i);
        printf("|");
        gotoxy(86,i);
        printf("|");
    }


    gotoxy(24,24);          //设置提示栏//
    for(i=24; i<=84; i++)
    {
        printf("-");
    }
    gotoxy(24,9);           //跳转光标//
};

